tutorials/actuatorLine/pitching/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 4.0 -1.524  0.000) // 0
    ( 4.0  1.524  0.000) // 1
    (-2.5  1.524  0.000) // 2
    (-2.5 -1.524  0.000) // 3
    ( 4.0 -1.524  2.134) // 4
    ( 4.0  1.524  2.134) // 5
    (-2.5  1.524  2.134) // 6
    (-2.5 -1.524  2.134) // 7 
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (32 48 24)
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }

    outlet
    {
	type patch;
	faces
        (
            (0 4 5 1)
        );
    }

    walls
    {
	type wall;
        faces
        (
            (1 5 6 2)
            (4 0 3 7)
        );
    }

    top
    {
	type wall;
	faces
        (
            (4 7 6 5)
        );
    }

    bottom
    {
	type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
